// Да се състави програма, която по въведена шестнадесетъчна цифра извежда съответното десетично число. Решете програмата с помощта на оператор switch и без него.

#include "stdafx.h"
#include<iostream>
#include<windows.h>
using namespace std;

int main()
{
	SetConsoleOutputCP(1251);
	char n;
	cout<<"Въведете 16-ична цифра за конвертиране: ";
	cin>>n;
		switch (n)
	{
		case '0': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"0"<<endl; break;
		case '1': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"1"<<endl; break;
		case '2': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"2"<<endl; break;
		case '3': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"3"<<endl; break;
		case '4': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"4"<<endl; break;
		case '5': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"5"<<endl; break;
		case '6': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"6"<<endl; break;
		case '7': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"7"<<endl; break;
		case '8': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"8"<<endl; break;
		case '9': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"9"<<endl; break;
		case 'A': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"10"<<endl; break;
		case 'B': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"11"<<endl; break;
		case 'C': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"12"<<endl; break;
		case 'D': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"13"<<endl; break;
		case 'E': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"14"<<endl; break;
		case 'F': cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"15"<<endl; break;
		default: cout<<"Въведената 16-ична цифра съответства на десетичното число: "<<"Въвели Сте невалидни данни"<<endl; break;
	}
		system ("PAUSE");
		return 0;
}

