// P58_107.cpp Да се намери най-големият общ делител на две естествени числа по алгоритъма на Евклид с изваждане (докато двете числа са различни, от по-голямото се изважда по-малкото, като в следващата стъпка участват вече резултатът от изваждането и по-малкото число). В математиката естествено число е цяло положително число (1,2,3,...,n,...).
// nod

#include "stdafx.h"
#include <iostream>
#include<Windows.h>
using namespace std;

int main()
{
	SetConsoleOutputCP(1251);
	int a, b;
	cout<<"Въведете две естествени числа: "<<endl;
	cin>>a>>b;
	
	if (a<=0 || b<=0)
		cout<<"Въведените данни са некоректни!"<<endl;
	else
	{
		while (a!=b)
			if (a>b)
			a-=b;
			else 
			b-=a;//if (a>b) a=a-b; else b=b-a;
			cout<<"Най-големият общ делител на тези числа е: "<<a<<endl;
	}

	return 0;
}

